app/views/cart/orderCreate.html.erb

            quantity = item.quantity
            item = Item.find_by_id(id)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]