app/views/orders/index.html.erb

              <td class="right aligned">
                <%= order.order_date %>
---
SELECT "orders".* FROM "orders"