app/controllers/pages_controller.rb

SELECT "items".* FROM "items" WHERE (title like '%%')
---
    def search
        @search_term = params[:search_term]

        # interpolition
        query = "%#{params[:search_term]}%"

        @items = Item.where("name like ?", query)

SELECT "items".* FROM "items" WHERE (category like 'football')
---
    def category
        title = params[:title]
        @items = Item.where("category like ?" , title)

SELECT  "orders".* FROM "orders" ORDER BY "orders"."id" DESC LIMIT ?  [["LIMIT", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", "Paid"], ["updated_at", "2017-12-06 22:11:21.324015"], ["id", 21]]
---
    def paymentAccepted
        # here you could clear the cart
        # below the hash allows you to put a variable in a string'
        flash[:notice] = "Pago aceptado.Gracias por su compra"
        @order = Order.last
        @order.update_attribute(:status, 'Paid')